app/views/carts/index.html.erb

        <%=form_with model: cart, url: cart_path(cart.id), method: :patch do |form| %>
        <% var= Product.find(cart.product_id)%>
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]