app/controllers/api/v1/sellers_controller.rb

    def index
        @user=User.find(3)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
       #@user=User.find(3)
        @product =Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def create
      @user=User.find(3)
      @product =  @user.products.new(product_params)
      if @product.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "products" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 3], ["created_at", "2022-08-09 06:57:45.578967"], ["updated_at", "2022-08-09 06:57:45.578967"]]

    def update
        @product = Product.find(params[:id])
        if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "stok" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "iphone13"], ["stok", 6], ["updated_at", "2022-08-09 07:13:45.416461"], ["id", 18]]