app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "anjali@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "token" = ? WHERE "users"."id" = ?  [["updated_at", "2022-08-09 11:44:17.778467"], ["token", "6c5085e20c0602be07e2"], ["id", 4]]
---
    def create
       @user = User.where(email:params[:email]).first
       if @user && @user.valid_password?(params[:password])
         @token = SecureRandom.hex(10)
         @user.token=@token
         if @user.save

SELECT "users".* FROM "users" WHERE "users"."token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["token", "6c5085e20c0602be07e2"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "token" = ? WHERE "users"."id" = ?  [["updated_at", "2022-08-09 11:53:28.537219"], ["token", nil], ["id", 4]]
---
    def destroy
        @user=User.where(token: request.headers["token"]).first
        unless @user
            render json: {"message": "unauthorized"}
        else
            byebug
            @user.token=nil
            @user.save