app/controllers/carts_controller.rb

    def index
      @cart = Cart.all
---
SELECT "carts".* FROM "carts"

    def create
        @user=current_user
        @cart =@user.carts.create(cart_params)
        if @cart.save
           @cart.subtotal=(@cart.pro_stok).to_i*(@cart.pro_price).to_i
           @product= Product.find(@cart.product_id)

           @product.stok = @product.stok - @cart.pro_stok
           @product.save
           @cart.save
---
INSERT INTO "carts" ("pro_name", "pro_price", "product_id", "user_id", "sell_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["pro_name", "samsung"], ["pro_price", 12340.0], ["product_id", 9], ["user_id", 1], ["sell_id", 2], ["created_at", "2022-08-04 12:16:42.288836"], ["updated_at", "2022-08-04 12:16:42.288836"]]
UPDATE "carts" SET "subtotal" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["subtotal", 68000.0], ["updated_at", "2022-08-05 07:44:44.609939"], ["id", 20]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "products" SET "stok" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stok", 2], ["updated_at", "2022-08-04 13:23:15.580472"], ["id", 9]]

      def update
        @cart = Cart.find(params[:id])
        @oldstok =@cart.pro_stok
        if @cart.update(stok_params)
          @product= Product.find(@cart.product_id)
          if @oldstok < @cart.pro_stok
              @newstok = @cart.pro_stok-@oldstok
              @product.stok= @product.stok-@newstok
              @product.save
          else
            @newstok = @oldstok-@cart.pro_stok
            @product.stok = @product.stok + @newstok
            @product.save
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "carts" SET "pro_stok" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["pro_stok", 1], ["updated_at", "2022-08-05 09:49:27.136666"], ["id", 20]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "products" SET "stok" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stok", -2], ["updated_at", "2022-08-05 11:43:51.750610"], ["id", 10]]
UPDATE "carts" SET "subtotal" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["subtotal", 37035.0], ["updated_at", "2022-08-08 09:13:34.097520"], ["id", 44]]
UPDATE "products" SET "stok" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stok", 2], ["updated_at", "2022-08-05 09:50:00.918770"], ["id", 12]]

      def destroy
        @cart = Cart.find(params[:id])
        @product= Product.find(@cart.product_id)
        if @cart.destroy

           @product.stok = @product.stok + @cart.pro_stok
           @product.save
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 40]]
UPDATE "products" SET "stok" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stok", 2], ["updated_at", "2022-08-05 11:44:00.742478"], ["id", 10]]