app/controllers/customers_controller.rb

SELECT "products"."id" FROM "products"
---
  def index
    @product= Product.all