app/controllers/orders_controller.rb

    def index
        @orders=current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]

    def create
       @carts=current_user.carts
        @total=0
        # byebug
        @carts.each do |cart|
            @total=@total+cart.subtotal
        end
        @order=current_user.orders.new(TotalPrice: @total)
        if @order.save
            @carts.each do |cart|
                @product_id=cart.product_id
                @stok=cart.pro_stok
                @subtotal=cart.subtotal
                @order_details=@order.order_details.new(Product_id: @product_id, stok: @stok, subtotal: @subtotal)
                @order_details.save
            end
            @carts.destroy_all
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]
INSERT INTO "orders" ("user_id", "TotalPrice", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["TotalPrice", 61715.0], ["created_at", "2022-08-08 09:42:30.225493"], ["updated_at", "2022-08-08 09:42:30.225493"]]
INSERT INTO "order_details" ("Product_id", "stok", "subtotal", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Product_id", 9], ["stok", 2], ["subtotal", 12340], ["order_id", 2], ["created_at", "2022-08-08 09:43:34.339841"], ["updated_at", "2022-08-08 09:43:34.339841"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 43]]

    def show
        @order=Order.find(params[:id])
        @order_details=@order.order_details
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]