app/controllers/sellers_controller.rb

  def create
    @user = current_user
    @product = @user.products.new(product_params)
    if @product.save
---
INSERT INTO "products" ("user_id", "name", "price", "stok", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["name", "samsung"], ["price", 12340.0], ["stok", 9], ["created_at", "2022-08-03 09:25:52.010401"], ["updated_at", "2022-08-03 09:25:52.010401"]]

    def update
      @product = Product.find(params[:id])

      if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "stok" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stok", 5], ["updated_at", "2022-08-03 12:03:12.779046"], ["id", 1]]